app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:success] = 'Book was successfully created.'
     redirect_to book_path(@book)
    else
     @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "xxx"], ["body", "xxx"], ["created_at", "2021-03-11 04:22:07.288553"], ["updated_at", "2021-03-11 04:22:07.288553"]]
SELECT "books".* FROM "books"

  def update
      @book = Book.find(params[:id])
      @book.update(book_params)
    if @book.save
      flash[:success] = 'Book was successfully updated.'
     redirect_to book_path(@book)
    else
     @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "222"], ["body", "222"], ["updated_at", "2021-03-11 09:19:34.247272"], ["id", 5]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]